title: Data Exfiltration via AWS CLI using aws s3 and s3api
id: 1a3cc7de-4a85-4e10-9b6f-13ada55849f0
status: experimental
description: Detects execution of AWS CLI for Data Exflirtation using aws s3 and s3api commands
references:
    - https://docs.aws.amazon.com/cli/v1/userguide/cli-services-s3-commands.html
    - https://docs.aws.amazon.com/cli/latest/reference/s3api/put-object.html
author: MahirAli Khan
date: 2024/09/25
tags:
    - attack.exfiltration
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdline_S3_1:
        CommandLine|contains:
            - 's3 cp'
            - 's3 sync'
            - 's3 mv'
    selection_cmdline_S3_2:
        CommandLine|contains: 's3://'
    selection_cmdline_S3API:
        CommandLine|contains: 's3api put-object'
    condition: (all of selection_cmdline_S3_* ) or selection_cmdline_S3API
falsepositives:
    - Some administrators or automation could use AWS CLI to transfer data to S3.
level: medium
